{
  "intents": [
    {
      "tag": "greeting",
      "patterns": [
        "hi",
        "hello",
        "hey",
        "what's up",
        "good morning",
        "good evening",
        "yo",
        "hey there"
      ],
      "responses": [
        "Hey there — I’m Askew, the assistant for Achinthya’s portfolio. You can ask about his projects, skills, or AI work.",
        "Hello! Want to know about Achinthya’s projects or what he’s building?",
        "Hey! You can explore Achinthya’s work in AI, web apps, or coding here.",
        "Hi there! Curious about what Achinthya has been working on?",
        "Good to see you — I represent Achinthya’s development work.",
        "Yo! I can tell you about Achinthya’s AI tools, coding projects, or skills.",
        "Hey — want to check out some of Achinthya’s recent builds?",
        "Hello there! You can ask me about Achinthya’s AI, web apps, or development stack."
      ],
      "context_set": ""
    },
    {
      "tag": "goodbye",
      "patterns": [
        "bye",
        "see you",
        "see you later",
        "goodbye",
        "talk later",
        "ttyl"
      ],
      "responses": [
        "Catch you later 👋",
        "Goodbye — hope you enjoyed exploring Achinthya’s work!",
        "See you soon 👋",
        "Take care — come back anytime to explore more projects!",
        "Bye — glad you checked out Achinthya’s portfolio.",
        "See you later — feel free to revisit anytime!",
        "Goodbye — Achinthya keeps building, so come back for updates!",
        "Talk soon — hope you found something inspiring!"
      ],
      "context_set": ""
    },
    {
      "tag": "about",
      "patterns": [
        "who are you",
        "tell me about yourself",
        "what is askew",
        "introduce yourself",
        "who is achinthya"
      ],
      "responses": [
        "I’m Askew — the AI assistant for Achinthya’s portfolio. He’s a developer who builds AI, automation, and web-based tools.",
        "Askew here. I represent Achinthya — a student and coder passionate about AI and web apps.",
        "Achinthya is a developer focused on merging AI and real-world applications through clean, efficient design.",
        "He’s a student and coder who creates AI-integrated projects and interactive web tools.",
        "Achinthya works primarily in Python, JavaScript, and AI APIs.",
        "He’s passionate about generative AI, user experience, and creative automation.",
        "Achinthya’s work bridges AI integration, web interfaces, and real-world usability.",
        "You can explore his major projects like Imagify, Soka AI, and Study Sync."
      ],
      "context_set": ""
    },
    {
      "tag": "projects_list",
      "patterns": [
        "what projects has he built",
        "show projects",
        "projects",
        "portfolio projects",
        "list of projects"
      ],
      "responses": [
        "Here are some of Achinthya’s projects: Imagify, First-Hack, Soka AI, Study Sync, New-Tab, and bot-mc. Ask about any one to get more details.",
        "Achinthya has built several projects — Imagify, First-Hack, Soka AI, Study Sync, New-Tab, and bot-mc.",
        "He’s worked on projects covering AI, automation, and productivity — want to dive into one?",
        "You can ask me about Imagify, Soka AI, Study Sync, or any other project.",
        "These are Achinthya’s key creations — just name one for more info.",
        "His projects combine AI, frontend design, and backend logic.",
        "You can say a project’s name and I’ll explain what it does.",
        "Each project shows a different side of his skills — ask about any to explore deeper."
      ],
      "context_set": ""
    },
    {
      "tag": "imagify",
      "patterns": [
        "imagify",
        "tell me about imagify",
        "what is imagify",
        "imagify project",
        "image generator",
        "image generation website",
        "imagify how it works"
      ],
      "responses": [
        "Imagify is Achinthya’s largest project — a web app that generates images using Hugging Face APIs.",
        "It sends your text prompts to a Hugging Face image model and displays the generated output instantly.",
        "Imagify turns text into images using a clean, fast UI built by Achinthya.",
        "It’s built with Flask, React, and Hugging Face for image generation.",
        "Imagify handles API calls, caching, and response visualization efficiently.",
        "It’s a creative image generator that brings your ideas to life using AI.",
        "Imagify shows how Achinthya integrates AI models into user-friendly web interfaces.",
        "You can ask how the backend calls Hugging Face APIs for more technical details."
      ],
      "context_set": ""
    },
    {
      "tag": "first_hack",
      "patterns": [
        "first-hack",
        "first hack",
        "tell me about first-hack",
        "news website",
        "tech news site",
        "what is first-hack",
        "news aggregator"
      ],
      "responses": [
        "First-Hack is a tech-focused news website that aggregates the latest technology updates.",
        "It collects and curates tech and AI news from multiple sources.",
        "Achinthya built it to give developers a single place for daily tech updates.",
        "First-Hack focuses on clarity, simplicity, and speed — no distractions.",
        "It’s designed to help you keep up with the tech and AI world easily.",
        "The interface is lightweight and optimized for quick reading.",
        "First-Hack is perfect for anyone who wants a clean, focused news source.",
        "It’s a tech news aggregator powered by Achinthya’s custom backend."
      ],
      "context_set": ""
    },
    {
      "tag": "soka_ai",
      "patterns": [
        "soka ai",
        "soka-ai",
        "tell me about soka ai",
        "what is soka ai",
        "assistant pop up",
        "instant assistant"
      ],
      "responses": [
        "Soka AI is a fast, lightweight assistant that pops up instantly and uses Hugging Face APIs for smart replies.",
        "It’s designed for quick access and instant AI interactions.",
        "Soka AI provides fast responses using Hugging Face models under the hood.",
        "The UI is minimal — built for users who want instant help without loading heavy models.",
        "Achinthya made Soka AI as a proof of concept for a personal instant assistant.",
        "It connects to AI APIs, handles requests, and displays clean output in real-time.",
        "Soka AI proves how lightweight AI experiences can still feel powerful.",
        "It’s an efficient assistant project focusing on response time and user flow."
      ],
      "context_set": ""
    },
    {
      "tag": "study_sync",
      "patterns": [
        "study sync",
        "study-sync",
        "tell me about study sync",
        "study platform",
        "notes sharing site",
        "study sync features",
        "flashcards quizzes pdf whiteboard"
      ],
      "responses": [
        "Study Sync is a collaborative platform for students to share notes, flashcards, and quizzes.",
        "Users can create a digital whiteboard and export it as a PDF.",
        "It’s a study-oriented web platform built to encourage collaboration.",
        "Study Sync allows students to upload notes, create quizzes, and build shared resources.",
        "It’s optimized for learning communities and content sharing.",
        "Achinthya designed it with collaboration and offline study in mind.",
        "Study Sync includes PDF exports and quiz generators for seamless studying.",
        "It’s built for students who want an interactive and collaborative experience."
      ],
      "context_set": ""
    },
    {
      "tag": "new_tab",
      "patterns": [
        "new tab",
        "new-tab",
        "tell me about new tab",
        "advanced new tab",
        "what is new tab"
      ],
      "responses": [
        "New-Tab is an advanced browser home page with productivity features and shortcuts.",
        "It’s a custom new-tab replacement designed for efficiency and clean design.",
        "You get widgets, quick links, and notes all on one sleek dashboard.",
        "Achinthya built it as a better way to start your day productively.",
        "It’s a modern, personalized homepage for daily use.",
        "New-Tab is built to be simple, fast, and aesthetic.",
        "It offers users a smarter new-tab experience with useful tools.",
        "It’s great for productivity and organization-minded users."
      ],
      "context_set": ""
    },
    {
      "tag": "bot_mc",
      "patterns": [
        "bot-mc",
        "bot mc",
        "minecraft bot",
        "tell me about bot-mc",
        "killing buddy",
        "minecraft killing buddy"
      ],
      "responses": [
        "bot-mc is a Minecraft bot that assists players in combat — your ‘killing buddy’.",
        "It automates in-game fighting actions to make gameplay smoother.",
        "Achinthya built bot-mc to assist with Minecraft combat automation.",
        "It executes tasks like attacking, defending, and item usage intelligently.",
        "The bot is designed to act as a support system for players.",
        "bot-mc shows Achinthya’s mix of gaming logic and automation.",
        "It improves combat performance and reduces manual effort.",
        "It’s a utility bot for Minecraft that focuses on combat support."
      ],
      "context_set": ""
    },
    {
      "tag": "project_tech_stack",
      "patterns": [
        "what tech does he use",
        "what technologies",
        "tech stack for imagify",
        "what stack for study sync",
        "what did he use to build",
        "what frameworks did he use"
      ],
      "responses": [
        "Achinthya mainly uses Python and JavaScript. His projects often combine Flask or Node for backends and React or Vanilla JS for frontends.",
        "He uses Hugging Face APIs for AI integrations and web frameworks for interaction layers.",
        "Most of his projects use Flask for backend logic and React for the frontend.",
        "His stack includes Python, JS, Flask, React, and RESTful APIs.",
        "For AI projects, Achinthya relies on Hugging Face endpoints and caching strategies.",
        "He builds small, modular services for speed and flexibility.",
        "His focus is on scalability and responsiveness, even in minimal setups.",
        "He keeps his stack modern yet lightweight — AI plus clean UI."
      ],
      "context_set": ""
    },
    {
      "tag": "skills",
      "patterns": [
        "skills",
        "tech stack",
        "what can he do",
        "what languages does he know",
        "frameworks",
        "tools he uses"
      ],
      "responses": [
        "Achinthya’s core skills include Python, JavaScript, React, Flask, and API integration.",
        "He’s proficient in building full-stack web apps with AI components.",
        "His expertise lies in merging AI models with interactive interfaces.",
        "He’s skilled in front-end frameworks like React and backend frameworks like Flask and Node.",
        "He focuses on creating fast, functional, and scalable AI-driven tools.",
        "His toolset includes Python, JS, Git, REST APIs, and Hugging Face integrations.",
        "Achinthya combines clean design with technical precision.",
        "He enjoys turning ideas into working, intelligent web experiences."
      ],
      "context_set": ""
    },
    {
      "tag": "contact",
      "patterns": [
        "contact",
        "email",
        "how to contact",
        "reach out",
        "get in touch",
        "business inquiry"
      ],
      "responses": [
        "You can contact Achinthya at <b>achinthya@example.com</b>.",
        "For professional inquiries, reach out via <b>achinthya@example.com</b>.",
        "You can also connect with him on LinkedIn.",
        "Email is the best way to reach Achinthya directly.",
        "For collaborations or questions, send an email to <b>achinthya@example.com</b>.",
        "Business or project discussions are welcome via email.",
        "You can find links to his GitHub and LinkedIn in the social section.",
        "All professional communication should go through email or LinkedIn."
      ],
      "context_set": ""
    },
    {
      "tag": "social",
      "patterns": [
        "github",
        "linkedin",
        "show github",
        "where is his github",
        "linkedin profile",
        "social links"
      ],
      "responses": [
        "GitHub: <a href='https://github.com/achinthya' target='_blank'>github.com/achinthya</a>",
        "LinkedIn: <a href='https://linkedin.com/in/achinthya' target='_blank'>linkedin.com/in/achinthya</a>",
        "You can explore his repositories on GitHub.",
        "Connect with him professionally on LinkedIn.",
        "His GitHub has all the project source codes.",
        "The portfolio and repositories are linked there.",
        "Follow his updates and projects via LinkedIn.",
        "You can access both GitHub and LinkedIn links directly from here."
      ],
      "context_set": ""
    },
    {
      "tag": "ai_interest",
      "patterns": [
        "ai",
        "ai projects",
        "machine learning",
        "hugging face",
        "image generation",
        "generative ai"
      ],
      "responses": [
        "AI is at the core of Achinthya’s work — especially in Imagify and Soka AI.",
        "He works extensively with Hugging Face APIs and ML models.",
        "Achinthya explores generative AI and builds interfaces around it.",
        "He focuses on using AI models for creative and practical web solutions.",
        "His goal is to make AI feel usable and real-world ready.",
        "He integrates models via APIs rather than heavy local deployment.",
        "He experiments with fast inference, prompt handling, and caching.",
        "AI-driven design and user experience are central to his projects."
      ],
      "context_set": ""
    },
    {
      "tag": "personal_block",
      "patterns": [
        "where does he live",
        "age",
        "is he single",
        "who is his girlfriend",
        "salary",
        "what is his religion",
        "what is his politics",
        "personal question"
      ],
      "responses": [
        "Let’s keep it professional — you can ask about Achinthya’s projects, skills, or tech, not personal details.",
        "Askew is designed for professional questions only.",
        "That’s a personal topic — please stick to professional content.",
        "You can ask about his work, but not private life details.",
        "Let’s stay on the technical or project side.",
        "Askew doesn’t discuss personal or private matters.",
        "This assistant only handles professional information.",
        "If you’d like, I can tell you about his work instead."
      ],
      "context_set": ""
    },
    {
      "tag": "inappropriate",
      "patterns": [
        "i love you",
        "marry me",
        "flirt",
        "sexy",
        "date me",
        "kiss"
      ],
      "responses": [
        "That’s not appropriate — please keep it professional.",
        "Askew only handles project and tech discussions.",
        "Let’s talk about AI, projects, or code instead.",
        "This is a professional portfolio assistant — not for that.",
        "Please stay on relevant topics.",
        "Ask about projects or skills instead.",
        "Keep it professional — that’s not in scope.",
        "Askew’s focus is on Achinthya’s work and development."
      ],
      "context_set": ""
    },
    {
      "tag": "unknown_but_relevant",
      "patterns": [
        "what's his next project",
        "what is he planning next",
        "favorite model",
        "does he offer consulting",
        "pricing",
        "does he take freelance",
        "how can I hire him",
        "does he accept projects"
      ],
      "responses": [
        "That detail isn’t available yet — if you know it, you can provide it and I’ll save it for later updates.",
        "I don’t have that info yet, but you can share the right answer to add it.",
        "That’s not documented — you can teach me by providing the official answer.",
        "If you share the correct info, I can save it to the learning dataset.",
        "No current response available — want to provide one?",
        "You can help improve my answers by providing the right detail.",
        "That’s not in the current dataset yet.",
        "Would you like to teach Askew the proper response for that?"
      ],
      "context_set": ""
    },
    {
      "tag": "bot_info",
      "patterns": [
        "how were you built",
        "what powers you",
        "what's under the hood",
        "how do you work",
        "what model do you use"
      ],
      "responses": [
        "Askew runs on a TF-IDF + Logistic Regression system for intent detection, with curated responses. No large language models are used.",
        "It’s powered by classic ML — not a neural LLM — for accuracy and speed.",
        "Askew uses text vectorization and classification to detect intent.",
        "Each user input is vectorized, matched to intent, and mapped to a response.",
        "No massive model here — just well-trained lightweight ML.",
        "The design focuses on transparency, performance, and clean response mapping.",
        "Askew also logs missing intents for learning updates.",
        "It’s simple, fast, and deterministic by design."
      ],
      "context_set": ""
    },
    {
      "tag": "thanks",
      "patterns": [
        "thanks",
        "thank you",
        "appreciate it",
        "good job",
        "nice"
      ],
      "responses": [
        "You’re welcome — glad that helped!",
        "Anytime — want links to Achinthya’s repos or demos?",
        "Glad to help! You can explore another project if you’d like.",
        "Happy to assist — check out more of his work if you want.",
        "Appreciate it — which project do you want to see next?",
        "Thanks — I can show you more about his stack or tools.",
        "You’re welcome — want a demo link?",
        "Glad you found that useful — there’s more to explore!"
      ],
      "context_set": ""
    },
    {
      "tag": "fallback",
      "patterns": [
        "?",
        "idk",
        "unsure",
        "what",
        "random text"
      ],
      "responses": [
        "I’m not sure I understood — you can ask about Achinthya’s projects, skills, or AI work.",
        "Could you rephrase that? I can help with projects, tools, or his stack.",
        "Try asking about one of his projects — like Imagify or Study Sync.",
        "Ask about his skills, stack, or the way his AI projects work.",
        "Not sure I caught that — want to know about his projects?",
        "Ask me about Imagify, Soka AI, or any of Achinthya’s tools.",
        "I can tell you how his apps work, or share their tech stack.",
        "Let’s try again — ask me something about his development work."
      ],
      "context_set": ""
    },
    {
      "tag": "no_of_projects",
      "patterns": [
        "How many projects has Achinthya built?",
        "What's the count of Achinthya's projects?",
        "Can you tell me how many projects Achinthya has?",
        "Number of projects by Achinthya?",
        "How many coding projects does Achinthya have?",
        "What's the total number of Achinthya's projects?",
        "How many notable projects does he have?",
        "List Achinthya's project count."
      ],
      "responses": [
        "Achinthya has built 6 notable projects.",
        "He has developed 6 significant projects.",
        "Achinthya's portfolio currently features 6 key projects.",
        "There are 6 notable projects by Achinthya.",
        "Achinthya has 6 major projects listed.",
        "His work includes 6 prominent projects.",
        "You can find 6 remarkable projects by Achinthya.",
        "Achinthya's project count is 6."
      ],
      "context_set": ""
    },
    {
      "tag": "github_contact",
      "patterns": [
        "How can I reach Achinthya on GitHub?",
        "What's Achinthya's GitHub profile?",
        "Where can I find Achinthya's code?",
        "Can you share Achinthya's GitHub link?",
        "How do I contact Achinthya for professional inquiries through GitHub?",
        "Link to Achinthya's GitHub account.",
        "Is Achinthya on GitHub?",
        "Where can I view his projects on GitHub?",
        "What's the best way to see his coding work?",
        "Show me Achinthya's GitHub."
      ],
      "responses": [
        "You can find Achinthya's projects and connect with him on GitHub: https://github.com/AchinthyaJ",
        "Achinthya's GitHub profile is available at: https://github.com/AchinthyaJ",
        "To explore Achinthya's code, please visit his GitHub: https://github.com/AchinthyaJ",
        "Here is the link to Achinthya's GitHub: https://github.com/AchinthyaJ",
        "For professional inquiries and to view his work, Achinthya's GitHub is: https://github.com/AchinthyaJ",
        "His GitHub link is: https://github.com/AchinthyaJ",
        "Yes, Achinthya's professional work is showcased on GitHub: https://github.com/AchinthyaJ",
        "You can view all his notable projects and contributions on his GitHub profile: https://github.com/AchinthyaJ",
        "The primary way to review Achinthya's coding work and projects is via his GitHub: https://github.com/AchinthyaJ",
        "Achinthya's GitHub can be accessed here: https://github.com/AchinthyaJ"
      ],
      "context_set": ""
    },
    {
      "tag": "x_contact",
      "patterns": [
        "How can I reach Achinthya on X?",
        "What's his X handle?",
        "Where can I find him on Twitter?",
        "How to connect with Achinthya via X?",
        "What's Achinthya's X profile link?",
        "Can I contact him on X (Twitter)?",
        "I'd like to follow Achinthya on X.",
        "What's the best way to contact Achinthya on X?",
        "His Twitter handle, please.",
        "How do I find Achinthya's X account?"
      ],
      "responses": [
        "You can find Achinthya on X here: https://x.com/achuiscoding",
        "Achinthya's X handle is @achuiscoding. You can reach him at https://x.com/achuiscoding",
        "His X profile is https://x.com/achuiscoding",
        "Connect with Achinthya on X via: https://x.com/achuiscoding",
        "Here is Achinthya's X (Twitter) profile: https://x.com/achuiscoding",
        "Achinthya's X account is https://x.com/achuiscoding",
        "To contact Achinthya on X, please visit: https://x.com/achuiscoding",
        "You can follow Achinthya on X at: https://x.com/achuiscoding",
        "His X (formerly Twitter) profile link is https://x.com/achuiscoding",
        "Find Achinthya on X at this link: https://x.com/achuiscoding"
      ],
      "context_set": ""
    },
    {
      "tag": "about_more",
      "patterns": [
        "Who is Achinthya?",
        "Tell me about Achinthya.",
        "Can you introduce Achinthya?",
        "Who is the developer Achinthya?",
        "What can you tell me about Achinthya?",
        "Could you give me some background on Achinthya?",
        "Who is the person you represent?",
        "I'd like to know more about Achinthya's professional background.",
        "Give me a summary of Achinthya.",
        "What's Achinthya's professional identity?"
      ],
      "responses": [
        "Achinthya is a developer with expertise in Python, Node.js, web development, and AI/Machine Learning.",
        "He is a developer known for notable projects like Imagify, First-Hack, and Soka AI.",
        "Achinthya is a developer who codes for fun, specializing in AI/ML, web development, Python, and Node.js.",
        "He's a talented developer with a strong background in AI, web technologies, and Python.",
        "Achinthya is the developer behind notable projects such as Imagify, Study Sync, and bot-mc.",
        "He is a passionate developer, specializing in AI/ML, web development, Python, and Node.js.",
        "Achinthya is a developer whose work includes AI projects like Soka AI and web platforms like Study Sync.",
        "I represent Achinthya, a developer skilled in Python, Node.js, web development, and AI/ML.",
        "Achinthya is a developer known for his various projects and expertise across AI, web dev, and Python.",
        "He is a developer with a portfolio showcasing expertise in AI/ML, Python, Node.js, and web development."
      ],
      "context_set": ""
    },
    {
      "tag": "projects_general",
      "patterns": [
        "What's Achinthya's most challenging project?",
        "Which project showcases the most complexity?",
        "Tell me about Achinthya's most advanced work.",
        "What's the most intricate project Achinthya has tackled?",
        "Which of his projects required the most development effort?",
        "Can you describe Achinthya's biggest project?",
        "Which project is considered his magnum opus?",
        "What's Achinthya's most sophisticated project?",
        "Which project has the deepest technical scope?",
        "Highlight Achinthya's most complex build."
      ],
      "responses": [
        "Achinthya's biggest and most advanced project is Imagify, an AI image generation website that integrates with Hugging Face models.",
        "Imagify is considered Achinthya's most complex project. It's an AI image generation platform built with a Flask backend and a frontend.",
        "Without a doubt, Imagify stands out as Achinthya's most technically sophisticated project, featuring end-to-end AI integration.",
        "The project demonstrating the most complexity is Imagify. It leverages Hugging Face APIs for AI image generation within a custom web application.",
        "Achinthya views Imagify as his most advanced creation. It involves a full-stack implementation to deliver creative AI image generation.",
        "Imagify, his AI image generation website, represents Achinthya's most complex and extensive project to date.",
        "Among his projects, Imagify showcases the deepest technical scope, combining frontend design with a Flask backend to interact with AI models.",
        "For sheer complexity and advanced features, Imagify is Achinthya's standout project. It's a comprehensive AI-powered web tool.",
        "Achinthya's most challenging and rewarding project has been Imagify, where he built a user-friendly interface for advanced AI image creation.",
        "The Imagify project is a testament to Achinthya's full-stack capabilities and AI integration skills, making it his most complex undertaking."
      ],
      "context_set": ""
    },
    {
      "tag": "frameworks",
      "patterns": [
        "What frameworks does Achinthya use most?",
        "Which frameworks are Achinthya's favorites?",
        "What are the primary frameworks Achinthya works with?",
        "Does Achinthya have a preferred framework?",
        "What frameworks does he utilize in his projects?",
        "Can you list the frameworks Achinthya is proficient in?",
        "Which frameworks does Achinthya rely on for development?",
        "What are Achinthya's go-to frameworks?",
        "Which backend or frontend frameworks does he use?",
        "Tell me about Achinthya's framework preferences."
      ],
      "responses": [
        "Achinthya primarily uses Flask for backend development and React for frontend interfaces. He values their efficiency and flexibility.",
        "For his projects, Achinthya often leverages Flask and React, focusing on building robust and user-friendly web experiences.",
        "He has a strong preference for frameworks like Flask and React, which enable him to create clean, performant, and well-designed applications.",
        "Achinthya's main frameworks include Flask for the backend and React for the frontend, allowing him to develop full-stack solutions.",
        "You'll frequently see Achinthya working with Flask, Express (Node.js), and React, as they align with his goal of building practical, AI-integrated web applications.",
        "He's quite comfortable with Flask and React. These frameworks help him bring his creative, technical, and AI-driven projects to life.",
        "Achinthya's toolkit prominently features Flask and React, chosen for their capability in developing end-to-end systems and user-friendly interfaces.",
        "When it comes to frameworks, Achinthya gravitates towards Flask and React, which support his emphasis on efficient logic and clean UI.",
        "He prefers frameworks that facilitate fast prototyping and functional design, such as Flask and React, often integrating them with AI APIs.",
        "Achinthya's go-to frameworks are Flask and React, which allow him to effectively merge AI functionality into smooth, web-based experiences."
      ],
      "context_set": ""
    },
    {
      "tag": "skills_general",
      "patterns": [
        "What kind of tech skills does Achinthya have?",
        "Can you tell me about Achinthya's technical expertise?",
        "What are Achinthya's main coding strengths?",
        "Which programming languages and technologies is Achinthya proficient in?",
        "What's Achinthya's skill set?",
        "Tell me about Achinthya's development capabilities.",
        "What does Achinthya specialize in?",
        "What are his strongest tech areas?",
        "Could you list Achinthya's core skills?",
        "What technologies does he work with?"
      ],
      "responses": [
        "Achinthya's core strengths lie in Python, Node.js, and full-stack web development. He also has significant expertise in Artificial Intelligence and Machine Learning.",
        "He's proficient in Python and Node.js, with a strong focus on web development, both frontend and backend. AI/ML application is also a key skill.",
        "Achinthya is skilled in Python, Node.js, and comprehensive web development. His passion also extends to Artificial Intelligence and Machine Learning.",
        "You'll find Achinthya is very capable with Python, Node.js, and full-stack web development. He particularly enjoys integrating AI/ML models into his projects.",
        "His technical toolkit includes Python, Node.js, and strong web development skills, covering both frontend and backend. He's also deeply involved with AI and Machine Learning.",
        "Achinthya specializes in Python, Node.js, and web development, with a notable interest in applying AI and Machine Learning principles to build practical solutions.",
        "With a solid foundation in Python and Node.js, Achinthya excels in web development (frontend and backend) and has a keen focus on Artificial Intelligence and Machine Learning.",
        "Achinthya’s primary technical skills are Python, Node.js, web development expertise, and a strong understanding of Artificial Intelligence and Machine Learning concepts.",
        "He's highly skilled in Python and Node.js, a full-stack web developer, and has significant experience in the AI/ML space, often building integrated applications.",
        "Achinthya's main technical skills encompass Python, Node.js, full-stack web development, and leveraging AI/ML to create innovative and efficient solutions."
      ],
      "context_set": ""
    },
    {
      "tag": "Project_List",
      "patterns": [
        "What projects has Achinthya worked on?",
        "Can you tell me about Achinthya's projects?",
        "List Achinthya's main projects.",
        "What are some examples of his work?",
        "Show me his portfolio projects.",
        "What kind of things does Achinthya build?",
        "Could you describe Achinthya's development portfolio?",
        "Which projects showcase his skills?",
        "Tell me about the applications Achinthya has created.",
        "What's in Achinthya's project showcase?"
      ],
      "responses": [
        "Achinthya has a diverse range of projects! Some key ones include Imagify, an AI image generation website; First-Hack, a tech news aggregator; Soka AI, a fast-launch AI assistant; Study Sync, a collaboration platform; New-Tab, an advanced browser new tab page; and bot-mc, a Minecraft automation bot.",
        "Certainly! Achinthya's notable projects include Imagify, his most advanced AI image generator; First-Hack, a tech news aggregator; Soka AI, a quick AI assistant; Study Sync, for student collaboration; New-Tab, a customizable new tab page; and bot-mc, a Minecraft utility bot.",
        "Achinthya's portfolio features projects like Imagify (AI image generation with Hugging Face), First-Hack (tech news aggregation), Soka AI (minimal-latency AI assistant), Study Sync (student platform), New-Tab (productivity browser extension), and bot-mc (Minecraft automation).",
        "He's built several cool projects! Highlights include Imagify, an AI image generation site; First-Hack, for tech news; Soka AI, a rapid AI assistant; Study Sync, a student collaboration tool; New-Tab, a smart browser new tab; and bot-mc, a Minecraft combat bot.",
        "Achinthya's projects showcase his versatility: Imagify is an AI image generator, First-Hack keeps you updated on tech, Soka AI offers instant Q&A, Study Sync facilitates group study, New-Tab enhances browser productivity, and bot-mc automates tasks in Minecraft."
      ],
      "context_set": ""
    },
    {
      "tag": "fp",
      "patterns": [
        "What was Achinthya's very first project?",
        "Tell me about his initial coding endeavor.",
        "What's the first major project Achinthya worked on?",
        "Can you describe Achinthya's foundational project?",
        "Which project did Achinthya start with?",
        "What was his first significant development?",
        "His earliest project?",
        "Where did Achinthya begin his project journey?",
        "Tell me about 'First-Hack'.",
        "What's the story behind Achinthya's first big project?"
      ],
      "responses": [
        "Achinthya's very first major project was 'First-Hack,' a tech-focused news aggregator. It collects and displays technology news from various sources to keep developers informed.",
        "The initial project Achinthya built was 'First-Hack.' It's a news aggregator designed to keep users updated on tech trends, built with a Python backend and a simple web frontend.",
        "'First-Hack' stands out as Achinthya's first significant project. It's a news platform that pulls technology updates, showcasing his early work with web scraping and frontend display.",
        "His foundational project is 'First-Hack,' a tech news aggregator. It uses a Python backend for data collection and a simple web frontend, highlighting his early steps in full-stack development.",
        "Achinthya started his project journey with 'First-Hack.' This project functions as a tech news hub, powered by a Python backend for news feeds and a user-friendly web interface.",
        "The first main project Achinthya developed was 'First-Hack.' It's a news aggregator that uses Python and a web frontend to bring developers the latest in technology news.",
        "Achinthya's 'First-Hack' project was his introduction to building complete web systems. It's a news aggregator, providing a centralized place for tech information.",
        "His earliest project, 'First-Hack,' is a tech-focused news aggregator that demonstrates his initial skills in Python backend development and simple web UIs.",
        "Achinthya began with 'First-Hack,' a project designed to aggregate technology news. It was a key learning experience in integrating backend logic with a frontend interface.",
        "Delving into 'First-Hack,' it was Achinthya's first major creation—a news aggregator that pulls tech news, showcasing his early knack for practical, problem-solving applications."
      ],
      "context_set": ""
    },
    {
      "tag": "enjoy_lang",
      "patterns": [
        "What languages does Achinthya enjoy the most?",
        "Which programming languages does he prefer using?",
        "What are Achinthya's favorite coding languages?",
        "Which languages does Achinthya find most enjoyable to work with?",
        "Does Achinthya have a preferred language for his projects?",
        "What programming languages does Achinthya like best?",
        "Which languages is Achinthya most passionate about?",
        "What's Achinthya's go-to language for coding?",
        "In what languages does Achinthya enjoy developing?",
        "Which technical stacks does he have the most fun with?"
      ],
      "responses": [
        "Achinthya truly enjoys working with Python and Node.js, as they form the core of his AI and web development projects.",
        "He's most passionate about Python and Node.js, often leveraging them for building innovative tools and AI-driven applications.",
        "Given his focus on AI and web development, Python and Node.js are where Achinthya finds the most enjoyment in his coding.",
        "Achinthya thrives using Python for AI/ML and Node.js for efficient web solutions, combining them in many of his creations.",
        "His primary enjoyment comes from coding in Python and Node.js, especially when integrating AI functionality into user-friendly web experiences.",
        "Python and Node.js are Achinthya's preferred languages, enabling him to explore creative, technical, and AI-driven projects for fun.",
        "He particularly enjoys the versatility of Python for AI applications and the robust capabilities of Node.js for backend development.",
        "Achinthya finds immense satisfaction in crafting solutions with Python and Node.js, which he uses for almost all his hobby projects and experiments."
      ],
      "context_set": ""
    },
    {
      "tag": "current_project",
      "patterns": [
        "What's Achinthya working on currently?",
        "Is Achinthya involved in any new projects?",
        "What's his latest project?",
        "What is Achinthya focusing on developing now?",
        "Any ongoing projects from Achinthya?",
        "What's the current project Achinthya is busy with?",
        "What's next for Achinthya's development?",
        "What's the current focus of his coding?"
      ],
      "responses": [
        "Achinthya is currently focused on enhancing me, Askew! I am the AI chatbot on his portfolio, designed to professionally represent his work and answer questions about his technical skills and projects.",
        "His primary development focus right now is on refining Askew, this interactive portfolio guide. I help explain his creative, technical, and AI-driven projects.",
        "I am Achinthya's current project! He built me to serve as his public-facing technical assistant, articulating his projects, skills, and developer philosophy.",
        "Achinthya is actively working on improving Askew, the AI chatbot you're interacting with. My purpose is to clearly articulate his projects, skills, and coding interests.",
        "His latest endeavors revolve around Askew, the AI chatbot on his portfolio. It's built to explain his projects, skills, tools, and developer philosophy clearly and professionally.",
        "The main project Achinthya is engaged with at the moment is Askew, the AI chatbot. I'm here to provide professional insights into his work and technical capabilities."
      ],
      "context_set": ""
    },
    {
      "tag": "learn_next",
      "patterns": [
        "What's next for Achinthya's learning?",
        "What new technologies is Achinthya interested in learning?",
        "What does Achinthya plan to learn next in coding?",
        "Does Achinthya have any future learning goals?",
        "What's on Achinthya's learning roadmap?",
        "What new skills does Achinthya want to acquire?",
        "What areas of AI is Achinthya exploring next?",
        "What's Achinthya's next learning challenge?",
        "What does Achinthya want to build next?",
        "What's Achinthya's long-term learning objective?"
      ],
      "responses": [
        "Achinthya is currently focused on making more advanced ML Models and AI solutions.",
        "His next learning phase involves diving deeper into ML models and artificial intelligence development.",
        "Achinthya's long-term ambition is to build widely recognized Large Language Models (LLMs).",
        "He's actively learning and exploring new ways to create powerful ML models and AI.",
        "A key interest for Achinthya right now is the development of innovative ML Models and AI systems.",
        "He's dedicated to expanding his expertise in AI, with a particular eye on building impactful LLMs.",
        "His immediate learning goal is to enhance his skills in creating robust ML Models and AI applications.",
        "Achinthya aims to master more advanced concepts in AI to achieve his goal of developing recognized LLMs.",
        "You'll find Achinthya focusing on learning to craft sophisticated ML Models and pushing the boundaries of AI.",
        "He's on a path to becoming proficient in building LLMs, seeing it as his major long-term development goal."
      ],
      "context_set": ""
    },
    {
      "tag": "code_background",
      "patterns": [
        "How did Achinthya begin his coding journey?",
        "When did Achinthya start coding?",
        "What was Achinthya's introduction to coding?",
        "Can you tell me about Achinthya's coding background?",
        "How long has Achinthya been coding?",
        "What programming language did Achinthya learn first?",
        "When did Achinthya get into programming?",
        "How did Achinthya start out in software development?",
        "Tell me about Achinthya's initial coding experience.",
        "What's Achinthya's origin story in coding?"
      ],
      "responses": [
        "Achinthya began coding around three years ago, starting with Python, and has been building projects ever since.",
        "He started his coding journey about three years ago, initially learning Python.",
        "Achinthya got into coding approximately three years ago, where he first picked up Python.",
        "His coding background started roughly three years ago, with Python being his first language.",
        "Achinthya's introduction to coding was about three years ago when he began learning Python.",
        "He's been coding for approximately three years, kicking things off by learning Python.",
        "Achinthya first started coding around three years ago, beginning with Python and then moving on to various projects.",
        "Around three years ago, Achinthya began his coding path by learning Python.",
        "His coding journey commenced about three years ago, focusing initially on Python.",
        "Achinthya's initial foray into coding was with Python, roughly three years ago."
      ],
      "context_set": ""
    },
    {
      "tag": "aiml_history",
      "patterns": [
        "When did Achinthya start learning AI?",
        "How long has he been into Machine Learning?",
        "What's his AI/ML learning timeline?",
        "When did he get into artificial intelligence?",
        "His journey in AI, when did it start?",
        "How long has Achinthya been studying ML?",
        "When did he begin his AI studies?",
        "When did he pick up AI/ML?"
      ],
      "responses": [
        "Achinthya began learning AI and Machine Learning about a month ago.",
        "He started his journey into AI and ML just recently, approximately one month ago.",
        "His exploration into AI and Machine Learning commenced around a month back.",
        "Achinthya has been learning AI and ML for about a month now.",
        "He initiated his studies in AI and ML within the last month.",
        "It's been roughly a month since Achinthya started diving into AI and Machine Learning.",
        "Achinthya's focused learning in AI and ML began approximately one month ago.",
        "He picked up learning AI and ML about a month ago."
      ],
      "context_set": ""
    },
    {
      "tag": "collaboration",
      "patterns": [
        "Does Achinthya work with others on projects?",
        "Has he collaborated on any development work?",
        "Is Achinthya open to collaborations?",
        "Does he partner with other developers?",
        "What's his approach to teamwork?",
        "Does he typically work solo or in groups?",
        "Has Achinthya been part of any group projects?",
        "Does he have experience collaborating with others?"
      ],
      "responses": [
        "Achinthya has primarily focused on individual projects throughout his development journey, using each as a personal learning experiment.",
        "His work has largely been an independent pursuit, allowing him to dive deep into exploration and craft refinement.",
        "Achinthya typically builds and learns independently, rather than collaborating on projects with others.",
        "He has chosen to work solo on his projects, which allows for focused development and exploration of his ideas.",
        "While he's been in the field for a while, Achinthya has generally operated independently on his various projects.",
        "Achinthya's development process emphasizes independent creation and problem-solving."
      ],
      "context_set": ""
    },
    {
      "tag": "longtermgoal",
      "patterns": [
        "What's Achinthya's long-term goal as a developer?",
        "What does he aim to achieve in the long run?",
        "His ultimate goal as a coder?",
        "What are Achinthya's long-term development aspirations?",
        "What's his big picture goal for his coding career?",
        "What does Achinthya hope to build eventually?",
        "What's his vision for the future of his projects?",
        "Can you tell me about Achinthya's developer ambition?",
        "What's the ultimate objective of his work?",
        "Where does he see his development journey leading?"
      ],
      "responses": [
        "Achinthya's long-term goal as a developer is to build Large Language Models (LLMs) that are widely recognized.",
        "He aims to develop LLMs that achieve significant recognition in the broader tech community.",
        "His aspiration is to create impactful and widely acknowledged Large Language Models.",
        "Ultimately, Achinthya's objective is to build LLMs that gain widespread recognition.",
        "He envisions himself contributing widely recognized LLMs to the field.",
        "Achinthya is focused on the long-term goal of developing highly respected and recognized Large Language Models.",
        "His ultimate developer ambition is to build LLMs that are globally recognized for their capabilities.",
        "He seeks to create groundbreaking Large Language Models that achieve widespread acclaim.",
        "A primary long-term aim for Achinthya is to develop LLMs that are widely respected and adopted.",
        "His strategic goal is the creation of globally recognized LLMs that make a significant impact."
      ],
      "context_set": ""
    },
    {
      "tag": "deploy_info",
      "patterns": [
        "Where does Achinthya deploy his projects?",
        "What platforms does he use to host his applications?",
        "How are Achinthya's projects typically deployed?",
        "Which services does he use for project hosting?",
        "Where can I find his deployed work online?",
        "What's Achinthya's deployment strategy?",
        "Does he use a specific cloud for his projects?",
        "How does Achinthya get his projects live?",
        "On what platforms are Achinthya's applications hosted?",
        "Where are his projects published?"
      ],
      "responses": [
        "Achinthya primarily deploys his projects on Vercel.",
        "Most of Achinthya's projects are hosted on Vercel.",
        "His web applications are typically deployed using Vercel.",
        "You'll find Achinthya's projects, including this portfolio, hosted on Vercel.",
        "Achinthya utilizes Vercel for deploying most of his work to ensure performance and simplicity.",
        "Vercel is Achinthya's preferred platform for project deployment.",
        "For deployment, Achinthya commonly uses Vercel for his projects.",
        "His deployed projects, including the portfolio itself, are hosted on Vercel.",
        "Achinthya leverages Vercel to bring his web-based projects to life online.",
        "Many of his public-facing projects are deployed and accessible via Vercel."
      ],
      "context_set": ""
    }
  ]
}